# COMP-2231: Module 2 Assignment - Data Analysis with Pandas

The purpose of this notebook is to complete the Module 2 assignment by **importing, exploring, cleaning, and transforming** the provided dataset using the Pandas library.

**Student Info:**
- **Name:** Sion Kim
- **Student Number:** 0398774
- **Date:** 2025-09-21

**List:**
1. [Task 2: Data Importing](#task2)
2. [Task 3: Dataset Exploration](#task3)
3. [Task 4: Data Cleaning](#task4)
4. [Task 5: Data Type Conversions & Transformations](#task5)
5. [Final Dataframe](#task6)

<a id="task2"></a>
## Task 2: Data Importing
**Objective:** Load the dataset using Pandas and verify data integrity.

1. [Load the dataset sample_data_assignment.csv using pd.read_csv()](#2.1)  
2. [Display the first five rows using .head()](#2.2)  
3. [The shape of the data set using .shape](#2.3)  
4. [Print the column names, data types, and the amount of duplicate rows](#2.4)  
5. [Save a copy of the dataset as an Excel file (.xlsx) using to_excel()](#2.5)

### 2.1
Load the dataset sample_data_assignment.csv using pd.read_csv()

In [1]:
import pandas as pd

# Load the dataset
try:
    df = pd.read_csv("Dataset_for_Module_2_Assignment.csv")
    print("Dataset Loaded Successfully")
except FileNotFoundError:
    print("Error: File not found.")
except Exception as e:
    print(f"Error: {e}")

Dataset Loaded Successfully

### 2.2
Display the first five rows using .head()

In [2]:
# Display the first 5 rows of the dataframe
print("First 5 Rows")
display(df.head(5))

First 5 Rows

,order_id,customer_name,order_date,total_amount,status,category,region,priority
0,1000,Grace Lee,2022-12-27,290.94,shipped,Furniture,North,Medium
1,1001,David Wilson,2022-10-13,369.45,PENDING,furniture,North,Low
2,1002,Henry Martin,2022-09-30,649.46,PENDING,furniture,West,Low
3,1003,Emma Davis,2023-01-04,575.07,Pending,garden,East,Low
4,1004,Grace Lee,2022-03-03,362.54,Shipped,electronics,South,High

### 2.3
The shape of the data set using .shape

In [3]:
# Display the shape of the dataframe
print(f"Shape of Dataset: {df.shape}")

Shape of Dataset: (502, 8)

### 2.4
Print the column names, data types, and the amount of duplicate rows

In [4]:
# Display the columns of the dataframe
print(f"Column Names: {df.columns.tolist()}\n")

# Display the data types of the dataframe columns
print(f"Data Types of Columns:\n{df.dtypes}\n")

# Display the number of duplicate rows in the dataframe
print(f"Number of duplicate rows: {df.duplicated().sum()}")

Column Names: ['order_id', 'customer_name', 'order_date', 'total_amount', 'status', 'category', 'region', 'priority']

Data Types of Columns:
order_id           int64
customer_name     object
order_date        object
total_amount     float64
status            object
category          object
region            object
priority          object
dtype: object

Number of duplicate rows: 2

### 2.5
Save a copy of the dataset as an Excel file (.xlsx) using to_excel()

In [5]:
# Save the raw dataset as an Excel file without the index
df.to_excel('Dataset_for_Module_2_Assignment.xlsx', index=False)
print("\nDataset saved to 'Dataset_for_Module_2_Assignment.xlsx' as an Excel file.")

Dataset saved to 'Dataset_for_Module_2_Assignment.xlsx' as an Excel file.

<a id="task3"></a>
## Task 3: Dataset Exploration 
**Objective:** Understand dataset structure before cleaning.

1. [Use .info() and .describe() to summarize the dataset](#3.1)  
2. [Identify missing values using .isna().sum()](#3.2)  
3. [Find the number of unique values in the status and category columns using.nunique()](#3.3)  
4. [Sort the dataset by total_amount in descending order using .sort_values()](#3.4)

### 3.1
Use .info() and .describe() to summarize the dataset

In [6]:
# Display the information about the dataframe
print("Dataset Information:")
df.info()

# Display the summary statistics of the dataframe
print("\nSummary Statistics:")
df.describe()

Dataset Information:
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 502 entries, 0 to 501
Data columns (total 8 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   order_id       502 non-null    int64
 1   customer_name  502 non-null    object
 2   order_date     502 non-null    object
 3   total_amount   482 non-null    float64
 4   status         502 non-null    object
 5   category       502 non-null    object
 6   region         502 non-null    object
 7   priority       502 non-null    object
dtypes: float64(1), int64(1), object(6)
memory usage: 31.5+ KB

Summary Statistics:

          order_id  total_amount
count   502.000000    482.000000
mean   1249.027888    505.015851
std     144.387754    288.669519
min    1000.000000     14.590000
25%    1124.250000    242.165000
50%    1248.500000    509.260000
75%    1373.750000    751.877500
max    1499.000000    997.950000

### 3.2
Identify missing values using .isna().sum()

In [7]:
# Display the number of missing values in each column
print("Missing Values in Each Column:")
df.isna().sum()

Missing Values in Each Column:

order_id          0
customer_name     0
order_date        0
total_amount     20
status            0
category          0
region            0
priority          0
dtype: int64

### 3.3
Find the number of unique values in the status and category columns using.nunique()

In [8]:
# Display the number of unique values in the 'status' and 'category' columns
print(f"Unique values in 'status' column: {df['status'].nunique()}")
print(f"Unique values in 'category' column: {df['category'].nunique()}")

Unique values in 'status' column: 8
Unique values in 'category' column: 7

### 3.4
Sort the dataset by total_amount in descending order using .sort_values()

In [9]:
# Display the top 5 rows sorted by 'total_amount' in descending order
print("Top 5 Rows Sorted by 'total_amount' in Descending Order:")
display(df.sort_values(by='total_amount', ascending=False).head(5))

Top 5 Rows Sorted by 'total_amount' in Descending Order:

,order_id,customer_name,order_date,total_amount,status,category,region,priority
400,1398,Isabella White,2022-01-01,997.95,Cancelled,furniture,West,Low
193,1191,Grace Lee,2022-12-23,996.91,Pending,Furniture,West,High
450,1448,Alice Smith,2022-11-08,994.96,PENDING,GARDEN,East,High
434,1432,Jack Harris,2022-07-26,991.26,shipped,Furniture,West,Low
49,1049,Henry Martin,2022-08-11,990.06,PENDING,furniture,East,High

<a id="task4"></a>
## Task 4: Data Cleaning
**Objective:** Handle missing values, duplicates, and inconsistencies.

1. [Remove duplicate rows using .drop_duplicates()](#4.1)  
2. [Fill missing values in the total_amount column with the mean using .fillna()](#4.2)  
3. [Convert the status column to lowercase and remove extra spaces using.str.lower().str.strip()](#4.3)  
4. [Standardize the category column by replacing variations like "GARDEN" → "Garden" using .str.title()](#4.4)
5. [Display the cleaned dataset’s first 5 rows to verify changes](#4.5)

### 4.1
Remove duplicate rows using .drop_duplicates()

In [10]:
# Remove duplicate rows
initial_rows = len(df)
df.drop_duplicates(inplace=True)
print(f"Removed {initial_rows - len(df)} duplicate rows.")

Removed 2 duplicate rows.

### 4.2
Fill missing values in the total_amount column with the mean using .fillna()

In [11]:
# Fill missing values in total_amount with the mean
mean_amount = df['total_amount'].mean()
df['total_amount'] = df['total_amount'].fillna(mean_amount)
print(f"Filled missing 'total_amount' values with mean: {mean_amount:.2f}")

Filled missing 'total_amount' values with mean: 503.67

### 4.3
Convert the status column to lowercase and remove extra spaces using.str.lower().str.strip()

In [12]:
# Convert the status column to lowercase and remove extra spaces
df['status'] = df['status'].str.lower().str.strip()
print("Cleaned 'status' column (lowercase, stripped whitespace).")

Cleaned 'status' column (lowercase, stripped whitespace).

### 4.4
Standardize the category column by replacing variations like "GARDEN" → "Garden" using .str.title()

In [13]:
# Standardize the category column to Title Case
df['category'] = df['category'].str.title()
print("Standardized 'category' column (Title Case).")

Standardized 'category' column (Title Case).

### 4.5
Display the cleaned dataset’s first 5 rows to verify changes

In [14]:
# Display the cleaned dataframe
df_cleaned = df.copy()
print("First 5 Rows of Cleaned Dataset:")
display(df_cleaned.head(5))

First 5 Rows of Cleaned Dataset:

,order_id,customer_name,order_date,total_amount,status,category,region,priority
0,1000,Grace Lee,2022-12-27,290.94,shipped,Furniture,North,Medium
1,1001,David Wilson,2022-10-13,369.45,pending,Furniture,North,Low
2,1002,Henry Martin,2022-09-30,649.46,pending,Furniture,West,Low
3,1003,Emma Davis,2023-01-04,575.07,pending,Garden,East,Low
4,1004,Grace Lee,2022-03-03,362.54,shipped,Electronics,South,High

<a id="task5"></a>
## Task 5: Data Type Conversions & Transformations
**Objective:** Convert data types and apply transformations.

1. [Convert the total_amount column (which may be stored as object) to a float using pd.to_numeric()](#5.1)  
2. [Convert the order_date column to datetime format using pd.to_datetime()](#5.2)  
3. [Extract the year from order_date into a new column called order_year using.dt.year](#5.3)  
4. [Encode the status column using One-Hot Encoding (pd.get_dummies())](#5.4)
5. [Label encode the priority column using LabelEncoder from sklearn](#5.5)

### 5.1
Convert the total_amount column (which may be stored as object) to a float using pd.to_numeric()

In [15]:
# Convert total_amount column to a numeric (float) type
df_cleaned['total_amount'] = pd.to_numeric(df_cleaned['total_amount'])
print("Converted 'total_amount' to numeric (float).")

Converted 'total_amount' to numeric (float).

### 5.2
Convert the order_date column to datetime format using pd.to_datetime()

In [16]:
# Convert order_date column to datetime format
df_cleaned['order_date'] = pd.to_datetime(df_cleaned['order_date'])
print("Converted 'order_date' to datetime format.")

Converted 'order_date' to datetime format.

### 5.3
Extract the year from order_date into a new column called order_year using.dt.year

In [17]:
# Extract the year from order_date into a new column
df_cleaned['order_year'] = df_cleaned['order_date'].dt.year
print("Created 'order_year' column.")

Created 'order_year' column.

### 5.4
Encode the status column using One-Hot Encoding (pd.get_dummies())

In [18]:
# Encode the status column using One-Hot Encoding
df_cleaned = pd.get_dummies(df_cleaned, columns=['status'], prefix='status')
print("Applied One-Hot Encoding to 'status' column.")

Applied One-Hot Encoding to 'status' column.

### 5.5
Label encode the priority column using LabelEncoder from sklearn

In [19]:
# Import LabelEncoder
from sklearn.preprocessing import LabelEncoder

# Apply Label Encoding to the priority column
df_cleaned['priority_encoded'] = LabelEncoder().fit_transform(df_cleaned['priority'])
print("Applied Label Encoding to 'priority' column.")

Applied Label Encoding to 'priority' column.

<a id="task6"></a>
## Final Dataframe

In [20]:
# Display final dataframe head to show all transformations
print("First 30 Rows of Final Cleaned Dataset:")
display(df_cleaned.head(30))

print("\nFinal Dataset Information:")
df_cleaned.info()

First 30 Rows of Final Cleaned Dataset:

,order_id,customer_name,order_date,total_amount,category,region,priority,order_year,status_cancelled,status_pending,status_shipped,priority_encoded
0,1000,Grace Lee,2022-12-27,290.940000,Furniture,North,Medium,2022,False,False,True,2
1,1001,David Wilson,2022-10-13,369.450000,Furniture,North,Low,2022,False,True,False,1
2,1002,Henry Martin,2022-09-30,649.460000,Furniture,West,Low,2022,False,True,False,1
3,1003,Emma Davis,2023-01-04,575.070000,Garden,East,Low,2023,False,True,False,1
4,1004,Grace Lee,2022-03-03,362.540000,Electronics,South,High,2022,False,False,True,0
5,1005,Jack Harris,2022-03-25,986.650000,Garden,East,Medium,2022,False,False,True,2
6,1006,Charlie Brown,2023-01-03,609.720000,Electronics,East,Low,2023,False,True,False,1
7,1007,Grace Lee,2022-08-05,244.850000,Electronics,East,Medium,2022,False,True,False,2
8,1008,Henry Martin,2022-12-08,110.760000,Electronics,North,Medium,2022,False,True,False,2
9,1009,Emma Davis,2023-02-01,161.330000,Electronics,West,Low,2023,False,False,True,1
10,1010,David Wilson,2022-07-06,253.500000,Electronics,North,Low,2022,False,False,True,1
11,1011,Henry Martin,2022-01-19,169.070000,Garden,West,Medium,2022,True,False,False,2
12,1012,Henry Martin,2022-06-26,194.700000,Furniture,South,Low,2022,True,False,False,1
13,1013,Charlie Brown,2022-04-10,292.240000,Garden,South,Medium,2022,True,False,False,2
14,1014,Frank Thomas,2023-01-31,181.640000,Electronics,East,Medium,2023,False,True,False,2
15,1015,Emma Davis,2023-03-21,503.670833,Electronics,West,Low,2023,False,False,True,1
16,1016,Bob Johnson,2022-08-21,89.430000,Electronics,West,High,2022,True,False,False,0
17,1017,Henry Martin,2023-02-07,529.270000,Furniture,West,Low,2023,True,False,False,1
18,1018,Frank Thomas,2022-03-17,416.290000,Garden,East,High,2022,False,True,False,0
19,1019,Bob Johnson,2022-09-22,982.550000,Furniture,East,Medium,2022,False,True,False,2
20,1020,Emma Davis,2023-03-31,120.920000,Garden,South,Medium,2023,True,False,False,2
21,1021,Alice Smith,2022-10-11,403.880000,Furniture,North,High,2022,False,True,False,0
22,1022,Jack Harris,2022-07-25,969.780000,Garden,West,Medium,2022,False,False,True,2
23,1023,Frank Thomas,2022-08-11,866.850000,Garden,West,High,2022,False,False,True,0
24,1024,Isabella White,2023-01-19,818.900000,Furniture,North,High,2023,False,False,True,0
25,1025,Alice Smith,2022-02-21,265.320000,Electronics,West,Medium,2022,True,False,False,2
26,1026,Jack Harris,2022-12-05,179.180000,Furniture,East,High,2022,True,False,False,0
27,1027,Charlie Brown,2023-01-02,671.960000,Garden,East,Low,2023,False,False,True,1
28,1028,Grace Lee,2022-05-24,930.080000,Electronics,West,Low,2022,False,True,False,1
29,1029,David Wilson,2023-01-08,561.200000,Furniture,East,Medium,2023,False,True,False,2

Final Dataset Information:
<class 'pandas.core.frame.DataFrame'>
Index: 500 entries, 0 to 501
Data columns (total 12 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   order_id          500 non-null    int64
 1   customer_name     500 non-null    object
 2   order_date        500 non-null    datetime64[ns]
 3   total_amount      500 non-null    float64
 4   category          500 non-null    object
 5   region            500 non-null    object
 6   priority          500 non-null    object
 7   order_year        500 non-null    int32
 8   status_cancelled  500 non-null    bool
 9   status_pending    500 non-null    bool
 10  status_shipped    500 non-null    bool
 11  priority_encoded  500 non-null    int32
dtypes: bool(3), datetime64[ns](1), float64(1), int32(2), int64(1), object(4)
memory usage: 36.6+ KB